# -*- coding: utf-8 -*-
#  1. Напишіть програму, яка приймає два цілих числа від
# користувача і виводить суму діапазону чисел між ними.
num1 = int(input("Перше ціле число"))
num2 = int(input("Друге ціле число"))

start = min(num1, num2)
end = max(num1, num2)

total = 0
for x in range(start, end + 1):
    total += x

print("Сума діапазону:", total)

#  2. Напишіть програму, для знаходження суми всіх парних
# чисел від 1 до 100.
sum_even = 0
for n in range(2, 101, 2):
    sum_even += n
print("Сума парних від 1 до 100:", sum_even)

#  3. Напишіть програму, яка приймає рядок від користувача і
# виводить кожну літеру рядка на окремому рядку.
#  4. Напишіть програму, яка створює список цілих чисел та
# виводить новий список, який містить лише парні числа з
# вихідного списку.
#  5. Напишіть функцію, яка приймає список рядків від
# користувача і повертає новий список, що містить лише
# рядки, що починаються з великої літери.
#  6. Напишіть функцію, яка приймає список рядків від
# користувача і повертає новий список, що містить лише
# рядки, які містять слово "Python".
